<p><b>Команда №5</b></p>
<ul>
    <li>Пойманов Николай Алексеевич</li>
    <li>Орехов Павел Александрович</li>
    <li>Морозов Александр Сергеевич</li>
    <li>Судьин Сергей Вадимович</li>
</ul>

<p><b>функционал:</b></p>
<ul>
    <li class="text-success"><b>ВЫПОЛНЕНО!</b> Обработка пользователей магазина (добавление прав пользователям, ручная активация
        аккаунта пользователя, удаление пользователей) </li>
    <li class="text-success"><b>ВЫПОЛНЕНО!</b>  Обработка заказов магазина (просмотреть список всех заказов, просмотр состава заказа, изменение статуса заказа, доставки, вида оплаты)</li>
    <li class="text-success"><b>ВЫПОЛНЕНО!</b> Добавление, редактирование, удаление категорий товаров</li>
    <li>Добавление, редактирование, удаление товаров</li>
    <li>Выгрузка / загрузка товаров в БД по требованию</li>
    <li>Реализовывать рассылку писем пользователям сайта по определенным критериям админам,
        покупателям, новым пользователям и т.п.</li>
</ul>



